Revit 2027 API
RebarConstrainedHandle.AllowsConstraintToHostFaceOrToCover Method
 Checks if the RebarConstrainedHandle allows constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::FixedDistanceToHostFace] or [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToCover] type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AllowsConstraintToHostFaceOrToCover()
Public Function AllowsConstraintToHostFaceOrToCover As Boolean
public:
bool AllowsConstraintToHostFaceOrToCover()
member AllowsConstraintToHostFaceOrToCover : unit -> bool
Return Value
Boolean
 Returns true if the RebarConstrainedHandle allows constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::FixedDistanceToHostFace] or [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToCover] type.
See Also
Reference
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace